Repository: Mayar-Elghandour/Exoskeletal-suit-app
Catalog: lib/languages/app_*.arb
Languages: ar

source: Hello
ar: مرحبًا

source: Modes
ar: الأوضاع

source: Beginner
ar: مبتدئ

source: Advanced
ar: متقدم

source: Advanced modes
ar: أوضاع متقدمة

source: Automatic mode activated!
ar: تم تفعيل الوضع التلقائي!

source: Settings
ar: الإعدادات

source: User
ar: المستخدم

source: User Profile
ar: الملف الشخصي

source: Bluetooth connection
ar: اتصال بلوتوث

source: Themes
ar: السمات

source: Language
ar: اللغة

source: Get Started
ar: ابدأ الآن

source: Instructions
ar: التعليمات

source: For grabbing
ar: :للقبض

source: think of your right hand
ar: فكر في يدك اليمنى

source: For Elbow up
ar: :لرفع الكوع

source: No bonded devices found.
ar: لم يتم العثور على أجهزة مقترنة.

source: think of your left hand
ar: فكر في يدك اليسرى

source: For Elbow down
ar: :لخفض الكوع

source: think neutrally
ar: فكر بشكل محايد

source: Automatic
ar: تلقائي

source: Manual
ar: يدوي

source: Manual Modes
ar: أوضاع يدوية

source: Permission Required
ar: يتطلب إذن

source: Bluetooth and location permissions are required.
ar: يتطلب التطبيق إذن البلوتوث والموقع.

source: Unknown Device
ar: جهاز غير معروف

source: No file selected.
ar: لم يتم اختيار ملف.

source: Expected a JSON array.
ar: توقّع مصفوفة JSON.

# invalid_eeg_shape
source: Invalid EEG shape. Expected [19, 200]
ar: شكل EEG غير صالح. المتوقع [19, 200]

# classification
source: Class
ar: الفئة

source: Bluetooth send failed:
ar: فشل إرسال البلوتوث:

source: Error
ar: خطأ

source: Something went wrong:
ar: حدث خطأ ما:

source: Pick a XML file
ar: XML اختر ملف

source: Loading Model...
ar: جاري تحميل النموذج...

source: Waiting...
ar: انتظار...

source: Stop
ar: إيقاف

source: OK
ar: موافق

source: Cancel
ar: إلغاء

source: Go to Bluetooth Page
ar: اذهب إلى صفحة البلوتوث

source: Bluetooth Not Connected
ar: البلوتوث غير متصل

source: Please connect to a Bluetooth device before sending data.
ar: يرجى الاتصال بجهاز بلوتوث قبل إرسال البيانات.

source: Send Failed
ar: فشل الإرسال

source: ❌ Error sending data:
ar: ❌ حدث خطأ أثناء إرسال البيانات:

source: Select Device
ar: اختر الجهاز

source: ⚠️Still not connected to a device
ar: ⚠️ لم يتم الاتصال بجهاز بعد

source: Failed to connect to a device
ar: فشل الاتصال بالجهاز

source: ❌User didn't connect or connection failed
ar: ❌ لم يتصل المستخدم أو فشل الاتصال

source: Eating
ar: الأكل

source: Reading
ar: القراءة

source: Rehabilation
ar: إعادة التأهيل

source: Turn off
ar: إيقاف التشغيل

source: Note: To switch to another mode, turn off Eating mode.
ar: ملاحظة: للتبديل إلى وضع آخر، أوقف وضع الأكل.

source: Note: To switch to another mode, turn off Reading mode.
ar: ملاحظة: للتبديل إلى وضع آخر، أوقف وضع القراءة.

source: Note: To switch to another mode, turn off Rehabilation mode.
ar: ملاحظة: للتبديل إلى وضع آخر، أوقف وضع إعادة التأهيل.

source: Note: To switch to another mode, turn off Automatic mode.
ar: ملاحظة: للتبديل إلى وضع آخر، أوقف الوضع التلقائي.

source: position
ar: الوضعية

# elbow_max
source: Elbow max. position
ar: الوضعية القصوى للكوع

# elbow_min
source: Elbow min. position
ar: الوضعية الدنيا للكوع

# eating_drinking
source: Eating/ Drinking position
ar: وضعية الأكل/الشرب

source: Preview Themes
ar: معاينة الثيمات

source: Choose Theme
ar: اختر الثيم

source: Low Contrast
ar: تباين منخفض

source: High contrast
ar: تباين عالٍ

source: loading
ar: جارٍ التحميل

source: Choose Language
ar: اختر اللغة

source: Empower movement with the power of your mind
ar: مكِّن الحركة بقوة عقلك
